# Seção 1: Comandos mais usados no dia a dia

In [2]:
import pyodbc
import pandas as pd

In [3]:
# Some other example server values are
# server = 'localhost\sqlexpress' # for a named instance
# server = 'myserver,port' # to specify an alternate port
server = 'localhost,1433'
database = 'AdventureWorks2017'
username = 'yyyyyyy' #myusername
password = '{xxxxxxx}' #mypassword
driver = "{ODBC Driver 17 for SQL Server}"

string_conn = f"""
            DRIVER={driver};
            SERVER={server};
            DATABASE={database};
            UID={username};
            PWD={password}
            """
conn = pyodbc.connect(string_conn)

## SELECT



A instrução SQL SELECT é usada para buscar os dados de uma tabela de banco de dados que retorna esses dados na forma de uma tabela de resultados.


Sintaxe

SELECT column1, column2, columnN

FROM table_name;

In [4]:
query = "SELECT [CountryRegionCode], [Name] FROM Person.CountryRegion;"
pd.read_sql(query, conn)

    CountryRegionCode                  Name
0                  AF           Afghanistan
1                  AL               Albania
2                  DZ               Algeria
3                  AS        American Samoa
4                  AD               Andorra
..                ...                   ...
233                VI  Virgin Islands, U.S.
234                WF     Wallis and Futuna
235                YE                 Yemen
236                ZM                Zambia
237                ZW              Zimbabwe

[238 rows x 2 columns]

### Desafio 1

A equipe de marketing precisa fazer uma pesquisa sobre os nomes mais comuns de seus clientes. E precisa do nome e sobrenome de todos os clientes que estão cadastrados no sistema.

In [5]:
query = "SELECT FirstName, LastName FROM Person.Person;"
pd.read_sql(query, conn)

       FirstName     LastName
0           Syed        Abbas
1      Catherine         Abel
2            Kim  Abercrombie
3            Kim  Abercrombie
4            Kim  Abercrombie
...          ...          ...
19967   Patricia       Zubaty
19968       Judy     Zugelder
19969       Jake     Zukowski
19970    Michael     Zwilling
19971    Michael     Zwilling

[19972 rows x 2 columns]

## Distinct



SELECT DISTINCT é uma instrução é usada para retornar apenas valores distintos (diferentes).

Dentro de uma tabela, uma coluna geralmente contém muitos valores duplicados; e às vezes você só deseja listar os valores diferentes (distintos).


SELECT DISTINCT column1, column2, columnN

FROM table_name;

### Desafio 1
Quantos sobrenomes únicos temos em nossa tabela person.Person ?

In [6]:
query = """
        SELECT LastName 
        FROM Person.Person;
        """
pd.read_sql(query, conn)

          LastName
0            Abbas
1             Abel
2      Abercrombie
3      Abercrombie
4      Abercrombie
...            ...
19967       Zubaty
19968     Zugelder
19969     Zukowski
19970     Zwilling
19971     Zwilling

[19972 rows x 1 columns]

In [7]:
query = """
        SELECT DISTINCT LastName 
        FROM Person.Person;
        """
pd.read_sql(query, conn)

         LastName
0           Abbas
1            Abel
2     Abercrombie
3        Abolrous
4         Acevedo
...           ...
1201     Zimprich
1202       Zubaty
1203     Zugelder
1204     Zukowski
1205     Zwilling

[1206 rows x 1 columns]

## WHERE



A cláusula WHERE é usada para especificar uma condição ao buscar os dados de uma única tabela ou unindo-se a várias tabelas. Se a condição fornecida for satisfeita, apenas retornará um valor específico da tabela. Você deve usar a cláusula WHERE para filtrar os registros e buscar apenas os registros necessários.

Sintaxe

SELECT column1, column2, columnN 

FROM table_name

WHERE condition ;


https://www.tutorialspoint.com/sql/sql-operators.htm

### Desafio 1

A equipe de produção de produtos precisa do nome de todas as peças
que pesam mais que 500 kg, mas não mais que 700 kg para inspeção.

In [8]:
query = """
        SELECT Name 
        FROM Production.Product
        WHERE Weight > 500 AND  Weight < 700 ;
        """
pd.read_sql(query, conn)

                  Name
0  HL Road Front Wheel
1          LL Crankset
2          ML Crankset
3          HL Crankset

### Desafio 2
Foi pedido pelo marketing uma relação de todos os empregados  que são casados
e são assalariados.

In [9]:
query = """
        SELECT BusinessEntityID
        FROM HumanResources.Employee;
        """
pd.read_sql(query, conn)

     BusinessEntityID
0                 263
1                  78
2                 242
3                 125
4                 278
..                ...
285                82
286               157
287                95
288               215
289               112

[290 rows x 1 columns]

### Desafio 3

Um usuário chamado Peter Krebs está devendo um pagamento, consiga o email dele
para que possamos enviar uma cobrança! (você vai ter que usar a tabela person.Person
e depois a tabela person.EmailAdress)

In [10]:
query = """
        SELECT  BusinessEntityID 
        FROM Person.Person
        WHERE FirstName = 'Peter' AND LastName = 'Krebs' ;
        """
pd.read_sql(query, conn)

   BusinessEntityID
0                26

In [11]:
query = """
        SELECT EmailAddress 
        FROM Person.EmailAddress
        WHERE BusinessEntityID = 26
        """
pd.read_sql(query, conn)

                 EmailAddress
0  peter0@adventure-works.com

## COUNT



Retorna o número de linhas que correspondem a um critério especificado.

Sintaxe

SELECT COUNT(columnN)

FROM table_name

WHERE condition;

### Desafio 1

Quantos produtos temos cadastrados em nossa tabela de produtos(production.product) ?

In [12]:
query = """
        SELECT  COUNT(ProductID) 
        FROM Production.Product;
        """
pd.read_sql(query, conn)

0  504

### Desafio 2

Quantos tamanhos de produtos temos cadastrados em nossa tabela ?

In [13]:
query = """
        SELECT COUNT(Size) 
        FROM Production.Product;
        """
pd.read_sql(query, conn)

0  211

### Desafio 3

Quantos tamanhos diferentes de produtos temos cadastrados em nossa tabela ?

In [14]:
query = """
        SELECT COUNT(DISTINCT Size) 
        FROM Production.Product;
        """
pd.read_sql(query, conn)

0  18

## TOP



É usada para especificar o número de registros a serem retornados.

É útil em grandes tabelas com milhares de registros. Retornar um grande número de registros pode afetar o desempenho.

Sintaxe

SELECT TOP N column_name(s)

FROM table_name

WHERE condition;

In [15]:
query = """
        SELECT TOP 5 *
        FROM Production.Product;
        """
pd.read_sql(query, conn)

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,False,False,None,1000,750,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36.827
1,2,Bearing Ball,BA-8327,False,False,None,1000,750,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36.827
2,3,BB Ball Bearing,BE-2349,True,False,None,800,600,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36.827
3,4,Headset Ball Bearings,BE-2908,False,False,None,800,600,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,ECFED6CB-51FF-49B5-B06C-7D8AC834DB8B,2014-02-08 10:01:36.827
4,316,Blade,BL-2036,True,False,None,800,600,0.0,0.0,...,None,None,None,None,None,2008-04-30,None,None,E73E9750-603B-4131-89F5-3DD15ED5FF80,2014-02-08 10:01:36.827

## ORDER BY



A cláusula ORDER BY é usada para classificar os dados em ordem crescente ou decrescente, com base em uma ou mais colunas. Alguns bancos de dados classificam os resultados da consulta em ordem crescente por padrão.

Sintaxe

SELECT column1, column2, columnN 

FROM table_name 

WHERE condition

ORDER BY column1, column2, .. columnN ASC | DESC;

### Desafio 1

Obter o ProductID dos 10 produtos mais caros cadastrados no sistema, listando
do mais caro para o mais barato.

In [16]:
query = """
        SELECT TOP 10 ProductID 
        FROM AdventureWorks2017.Production.Product
        ORDER BY ListPrice DESC;
        """
pd.read_sql(query, conn)

   ProductID
0        749
1        750
2        751
3        752
4        753
5        771
6        772
7        773
8        774
9        775

### Desafio 2

Obter o nome e o número do produto dos produtos que tem o ProductID entre 1~4.

In [17]:
query = """
        SELECT TOP 4 Name, ProductNumber
        FROM AdventureWorks2017.Production.Product
        ORDER BY ListPrice ASC;
        """
pd.read_sql(query, conn)

                    Name ProductNumber
0                  Blade       BL-2036
1  Headset Ball Bearings       BE-2908
2        BB Ball Bearing       BE-2349
3           Bearing Ball       BA-8327

## BETWEEN



O BETWEEN é um operador seleciona valores dentro de um determinado intervalo. Os valores podem ser números, texto ou datas.

Sintaxe

SELECT column1, column2, columnN

FROM table_name

WHERE column_name BETWEEN value1 AND value2;

In [18]:
query = """
        SELECT *
        FROM Production.Product
        WHERE ListPrice  NOT BETWEEN 1000 AND 1500;
        """
pd.read_sql(query, conn)

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,False,False,None,1000,750,0.0000,0.00,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36.827
1,2,Bearing Ball,BA-8327,False,False,None,1000,750,0.0000,0.00,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36.827
2,3,BB Ball Bearing,BE-2349,True,False,None,800,600,0.0000,0.00,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36.827
3,4,Headset Ball Bearings,BE-2908,False,False,None,800,600,0.0000,0.00,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,ECFED6CB-51FF-49B5-B06C-7D8AC834DB8B,2014-02-08 10:01:36.827
4,316,Blade,BL-2036,True,False,None,800,600,0.0000,0.00,...,None,None,None,NaN,NaN,2008-04-30,NaT,None,E73E9750-603B-4131-89F5-3DD15ED5FF80,2014-02-08 10:01:36.827
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
452,995,ML Bottom Bracket,BB-8107,True,True,None,500,375,44.9506,101.24,...,None,M,None,5.0,96.0,2013-05-30,NaT,None,71AB847F-D091-42D6-B735-7B0C2D82FC84,2014-02-08 10:01:36.827
453,996,HL Bottom Bracket,BB-9108,True,True,None,500,375,53.9416,121.49,...,None,H,None,5.0,97.0,2013-05-30,NaT,None,230C47C5-08B2-4CE3-B706-69C0BDD62965,2014-02-08 10:01:36.827
454,997,"Road-750 Black, 44",BK-R19B-44,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2.0,31.0,2013-05-30,NaT,None,44CE4802-409F-43AB-9B27-CA53421805BE,2014-02-08 10:01:36.827
455,998,"Road-750 Black, 48",BK-R19B-48,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2.0,31.0,2013-05-30,NaT,None,3DE9A212-1D49-40B6-B10A-F564D981DBDE,2014-02-08 10:01:36.827
456,999,"Road-750 Black, 52",BK-R19B-52,True,True,Black,100,75,343.6496,539.99,...,R,L,U,2.0,31.0,2013-05-30,NaT,None,AE638923-2B67-4679-B90E-ABBAB17DCA31,2014-02-08 10:01:36.827

In [19]:
query = """
        SELECT HireDate
        FROM HumanResources.Employee
        WHERE HireDate BETWEEN '2009/01/01' AND '2010/01/01'
        ORDER BY HireDate;
        """
pd.read_sql(query, conn)

       HireDate
0    2009-01-01
1    2009-01-01
2    2009-01-02
3    2009-01-02
4    2009-01-02
..          ...
144  2009-12-22
145  2009-12-25
146  2009-12-25
147  2009-12-29
148  2010-01-01

[149 rows x 1 columns]

## IN



O IN é o comando permite que você especifique vários valores em uma cláusula WHERE.


Sintaxe

SELECT column1, column2, columnN 

FROM table_name 

WHERE Country IN ('Valor1', 'Valor2', 'ValorN');

In [20]:
query = """
        SELECT *
        FROM Person.Person
        WHERE BusinessEntityID IN (2,7,13)
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24
1,7,EM,False,None,Dylan,A,Miller,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",C45E8AB8-01BE-4B76-B215-820C8368181A,2009-02-01
2,13,EM,False,Ms.,Janice,M,Galvin,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",34EB99E0-7042-4DC1-A2FD-BDA290FF0E07,2010-12-16

In [21]:
query = """
        SELECT *
        FROM Person.Person
        WHERE BusinessEntityID NOT IN (2,7,13)
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07
1,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04
2,4,EM,False,None,Rob,None,Walters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28
3,5,EM,False,Ms.,Gail,A,Erickson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F3A3F6B4-AE3B-430C-A754-9F2231BA6FEF,2007-12-30
4,6,EM,False,Mr.,Jossef,H,Goldberg,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",0DEA28FD-EFFE-482A-AFD3-B7E8F199D56F,2013-12-16
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19964,20773,IN,False,None,Crystal,None,Guo,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D0A499A2-C258-43E9-AB06-F61543A71134,2014-03-19
19965,20774,IN,False,None,Isabella,F,Richardson,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",A4F7F248-82F3-43D5-B5A3-8BD1CB610254,2013-07-29
19966,20775,IN,False,None,Crystal,S,He,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CD0B82D0-3409-4497-A65F-A68E75EE26CB,2014-03-12
19967,20776,IN,False,None,Crystal,None,Zheng,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",386E35E8-97B3-43E4-9B5F-9594C2FF5CEA,2014-01-14
19968,20777,IN,False,None,Crystal,None,Hu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",1773C8F3-2CC7-4826-A7F5-30D3F36543CD,2013-10-16

## LIKE



A cláusula LIKE é usada para comparar um valor a valores semelhantes usando operadores curinga. Existem dois curingas usados ​​em conjunto com o operador LIKE.

- O sinal de porcentagem (%)
- O sublinhado (_)

O sinal de porcentagem representa zero, um ou vários caracteres. O sublinhado representa um único número ou caractere. Esses símbolos podem ser usados ​​em combinações.

Sintaxe
A sintaxe básica de% e _ é a seguinte -

***
SELECT FROM table_name

WHERE column LIKE 'XXXX%'

***
or 

SELECT FROM table_name

WHERE column LIKE '%XXXX%'

***
or

SELECT FROM table_name

WHERE column LIKE 'XXXX_'

***
or

SELECT FROM table_name

WHERE column LIKE '_XXXX'

***
or

SELECT FROM table_name

WHERE column LIKE '_XXXX_'

***

Você pode combinar um número N de condições usando os operadores AND ou OR. Aqui, XXXX pode ser qualquer valor numérico ou string.

In [22]:
query = """
        SELECT *
        FROM person.Person
        WHERE FirstName LIKE 'ovi%';
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,575,SC,False,Mr.,Ovidiu,None,Burlacu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B1BD6887-A5B7-4E1E-AEB8-A1F76A2F76F2,2012-07-31
1,11,EM,False,None,Ovidiu,V,Cracium,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D2CC2577-EF6B-4408-BD8C-747337FE5645,2010-11-28

In [23]:
query = """
        SELECT *
        FROM person.Person
        WHERE FirstName LIKE '%to';
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,297,SC,False,Sr.,Humberto,None,Acevedo,None,2,"<AdditionalContactInfo xmlns=""http://schemas.m...","<IndividualSurvey xmlns=""http://schemas.micros...",5A41D336-84CF-44D7-B12B-83B64B511F7E,2015-04-15 16:33:33.090
1,6623,IN,False,None,Alberto,None,Alonso,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",05D761C9-9BC5-4F36-8A66-84539E759BF8,2014-02-12 00:00:00.000
2,14805,IN,False,None,Roberto,M,Alonso,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D94A7C58-D9DC-49BF-9691-9FE3C11C9249,2014-02-04 00:00:00.000
3,6609,IN,False,None,Alberto,None,Alvarez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",7A5A74BC-342B-4E79-9F72-93AA4ECAB8C9,2014-01-16 00:00:00.000
4,14791,IN,False,None,Roberto,None,Alvarez,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",DC17CAF1-9F11-476E-ABFA-0CCCC2976857,2014-04-20 00:00:00.000
5,395,SC,False,Mr.,Alberto,F.,Baltazar,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B3622F28-96D2-45C4-8310-F9688C6C631F,2011-08-01 00:00:00.000
6,6637,IN,False,None,Alberto,R,Blanco,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6742A146-F65C-4534-B232-46F6348963E2,2014-01-07 00:00:00.000
7,6603,IN,False,None,Alberto,A,Diaz,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",AC769A5E-C34B-450F-A17B-D1A8685FA836,2013-07-25 00:00:00.000
8,14789,IN,False,None,Roberto,A,Diaz,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F43AF903-E27B-4B67-A0D3-09F81638991E,2012-10-07 00:00:00.000
9,6634,IN,False,None,Alberto,R,Dominguez,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F6926C96-712B-4E7E-8544-810F42D2441C,2013-07-27 00:00:00.000
10,14816,IN,False,None,Roberto,A,Dominguez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",43750EFC-A10B-494F-ACD5-6DC17E53E518,2013-03-22 00:00:00.000
11,6635,IN,False,None,Alberto,P,Gill,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",1182C943-371B-4068-A511-B05FB6B65430,2011-09-12 00:00:00.000
12,14817,IN,False,None,Roberto,W,Gill,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",FAD83E4C-C316-46D8-B6B4-063905ADA57B,2013-01-12 00:00:00.000
13,6600,IN,False,None,Alberto,None,Gomez,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D6811C04-AD6C-41FD-91A5-851EBC209F2D,2014-06-27 00:00:00.000
14,6628,IN,False,None,Alberto,R,Gutierrez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",773CF5A9-92BE-48BB-A92A-339093878B2D,2013-07-16 00:00:00.000
15,14813,IN,False,None,Roberto,None,Gutierrez,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E6A99B40-BE61-486F-9C77-6CB9FECEE859,2014-02-26 00:00:00.000
16,6607,IN,False,None,Alberto,D,Hernandez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",51A5A418-A316-427F-8348-8EA8E6825E12,2013-01-06 00:00:00.000
17,14790,IN,False,None,Roberto,None,Hernandez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6E60E8B9-C79B-4742-9B50-40D41C375584,2013-08-15 00:00:00.000
18,6611,IN,False,None,Alberto,C,Jiménez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B4E2828B-A107-46FF-826B-16B1A31008E5,2013-04-17 00:00:00.000
19,14796,IN,False,None,Roberto,D,Jiménez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",7E896603-9FB4-4C7C-802D-25BF48A85C15,2013-08-17 00:00:00.000
20,14201,IN,False,None,Masato,None,Kawai,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8ACA3B9-C4E2-411C-ABD3-C064E12F1E61,2014-01-13 00:00:00.000
21,6598,IN,False,None,Alberto,R,Martin,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",93F1371F-03C2-427A-BD79-43D36DEAF164,2013-09-17 00:00:00.000
22,14800,IN,False,None,Roberto,R,Moreno,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6E46056F-DB36-48CE-A5D7-F8805BCA4CF5,2012-06-01 00:00:00.000
23,14802,IN,False,None,Roberto,None,Munoz,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",86322156-911B-4E31-9570-89021159C52D,2013-07-10 00:00:00.000
24,6618,IN,False,None,Alberto,J,Muñoz,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",EB4E0072-A112-47CD-BC31-7675E0B34F47,2014-01-17 00:00:00.000
25,6627,IN,False,None,Alberto,C,Navarro,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",8DB02B42-1E58-46F7-9098-FCA9715560EA,2012-02-13 00:00:00.000
26,14812,IN,False,None,Roberto,None,Navarro,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F5F3CCF8-64F1-4718-9728-4522D7AA1EAF,2014-05-30 00:00:00.000
27,6650,IN,False,None,Alberto,None,Ortega,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",7C81003B-8FDC-444A-996F-ACF81EFAC4B5,2013-05-15 00:00:00.000
28,14837,IN,False,None,Roberto,R,Ortega,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",2B12D1D2-9865-4A28-B5D7-EA8CD2365BF7,2013-11-16 00:00:00.000
29,6640,IN,False,None,Alberto,None,Ramos,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",239DC95A-BD4C-46D5-8209-34FEAE95ABAA,2012-08-23 00:00:00.000
30,14824,IN,False,None,Roberto,M,Ramos,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",9AD91C2B-639C-45A8-AC9D-7393B882F7DB,2013-12-27 00:00:00.000
31,6624,IN,False,None,Alberto,None,Romero,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",760F804A-4B58-4D9E-8337-DBE738F33D2D,2014-03-30 00:00:00.000
32,14810,IN,False,None,Roberto,A,Romero,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B49CBBA7-238F-42D9-85A8-974A4256CCDF,2013-09-01 00:00:00.000
33,6647,IN,False,None,Alberto,W,Rowe,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",7D270918-E6EB-47A5-B62B-055594AD51A7,2013-10-12 00:00:00.000
34,14834,IN,False,None,Roberto,L,Rubio,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D280BE1D-477C-446C-AFAE-987C345B45D7,2013-08-13 00:00:00.000
35,6602,IN,False,None,Alberto,L,Ruiz,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",DFE61F1C-11F0-445E-AF56-BA9194A49F20,2014-04-17 00:00:00.000
36,14787,IN,False,None,Roberto,None,Ruiz,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",A509A6B0-6929-48A8-9455-CB1CB8369366,2013-04-04 00:00:00.000
37,6646,IN,False,None,Alberto,M,Sanz,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",85D0DC52-CE37-4327-849B-3C41BB22EA66,2013-11-28 00:00:00.000
38,14832,IN,False,None,Roberto,None,Sanz,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",104E23DF-90DF-4D98-AEE0-69CCF47C1168,2012-01-27 00:00:00.000
39,6638,IN,False,None,Alberto,L,Serrano,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6D704D0B-387A-4162-880B-7C3429E0F280,2013-05-01 00:00:00.000
40,6644,IN,False,None,Alberto,G,Suarez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",DA99E1FB-7BC0-4DF5-B17E-D73478B6538F,2013-09-06 00:00:00.000
41,14828,IN,False,None,Roberto,D,Suarez,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",14FDAB33-CB90-4D02-BD79-0AA586995065,2013-09-15 00:00:00.000
42,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00.000
43,14815,IN,False,None,Roberto,None,Townsend,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F812BBA0-7D8E-4005-9D99-EEB54A37FBB3,2012-11-27 00:00:00.000
44,14820,IN,False,None,Roberto,A,Vazquez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D399B8B6-FC1E-427B-B595-257469A2BFC8,2013-01-24 00:00:00.000

In [24]:
query = """
        SELECT *
        FROM person.Person
        WHERE FirstName LIKE '%essa%';
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,7396,IN,False,None,Vanessa,None,Barnes,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",BD180A71-6428-48E5-A40C-B942BA030265,2014-05-21
1,7421,IN,False,None,Vanessa,None,Bryant,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",81525463-0325-41F8-A3B4-0E9809139820,2012-06-01
2,7413,IN,False,None,Vanessa,None,Butler,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",91B951CB-5389-4121-8BDD-EDD74E1507CF,2014-01-14
3,7400,IN,False,None,Vanessa,None,Coleman,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",347BCAB0-1678-4B7A-8451-85A395CE93D1,2013-03-01
4,7427,IN,False,None,Vanessa,J,Diaz,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B327E0B6-EFBC-4A1B-A99F-D8437E2CD836,2014-05-01
5,7409,IN,False,None,Vanessa,None,Flores,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",09EA59E8-D277-4162-8511-062447189F6E,2014-02-06
6,7417,IN,False,None,Vanessa,None,Foster,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",DFE6A801-0D2D-4AD2-8F3F-20B5844F2C90,2013-09-04
7,7418,IN,False,None,Vanessa,None,Gonzales,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CEF2747A-5BC1-457A-9BA2-93EEC66E2C26,2013-07-27
8,7426,IN,False,None,Vanessa,None,Griffin,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",19FB2FA9-37CF-4DB7-A328-968A1EE84F87,2014-03-07
9,7428,IN,False,None,Vanessa,None,Hayes,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",71D8DBB6-4BD0-4DCB-B82E-B7380B5DBE55,2014-05-05
10,7399,IN,False,None,Vanessa,None,Henderson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",8319E1B8-7AEC-4AE3-B0C7-3429FA02E17C,2011-07-27
11,7408,IN,False,None,Vanessa,S,Hughes,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",C428EB9A-8E56-4DF9-918F-2D6BDE581AF2,2014-05-21
12,7401,IN,False,None,Vanessa,None,Jenkins,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6D216195-ABC2-4C45-A24B-3B8ADD12A455,2013-12-24
13,7405,IN,False,None,Vanessa,R,Long,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F1B283DA-569F-4854-BC8C-5170906AFE46,2013-07-20
14,7406,IN,False,None,Vanessa,B,Patterson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B1F28F19-05D4-4CE7-9266-DE3D45B00E27,2014-03-06
15,7403,IN,False,None,Vanessa,None,Perry,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B826B1B7-30F3-4706-A7B4-203D1678C560,2014-04-07
16,7404,IN,False,None,Vanessa,None,Powell,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",FEFF82E8-9AC5-4CDB-99C6-7AEB64B09D9E,2011-09-21
17,7392,IN,False,None,Vanessa,A,Price,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",5F755C55-7D2D-4C6D-9062-18D68C520226,2013-12-19
18,7397,IN,False,None,Vanessa,None,Ross,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",9581DCF6-E67C-4554-A77D-0AA7C02D75A5,2012-07-27
19,7422,IN,False,None,Vanessa,M,Russell,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",9DE18555-09FC-4D17-9D14-AF9020756F63,2012-05-22
20,7414,IN,False,None,Vanessa,J,Simmons,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",0D3B409D-0340-4484-95C2-A1F70262A522,2012-06-25
21,1873,SC,False,Ms.,Vanessa,J.,Tench,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",8A9EA10E-D7AD-4710-83D6-8F456AF7F994,2013-06-30
22,7410,IN,False,None,Vanessa,None,Washington,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",774138BF-56DE-4DDD-8826-FEF7DCEDA8E2,2012-03-15
23,7395,IN,False,None,Vanessa,V,Wood,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",62622DBE-C2B7-4EC0-A090-426A8DF9A5BE,2014-02-02

In [25]:
query = """
        SELECT *
        FROM person.Person
        WHERE FirstName LIKE '%es_';
        """
pd.read_sql(query, conn)

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,15201,IN,False,None,Teresa,None,Alonso,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",2E67FB53-AA67-4832-966F-9CC4EE953537,2013-07-05
1,13896,IN,False,None,Theresa,None,Alonso,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",9B2F459F-78C9-4E80-926C-5828F1F42A76,2013-10-29
2,15189,IN,False,None,Teresa,None,Alvarez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",117A99A9-6699-4C7C-BA13-43D361C847DF,2014-03-26
3,13890,IN,False,None,Theresa,H,Alvarez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",7B613205-4478-4EC1-9BE9-3FCA9D4138B7,2011-10-13
4,375,SC,False,Ms.,Teresa,None,Atkinson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",6D3F3644-31EB-42B2-BCB1-4A970D2EFAF3,2011-08-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
65,6495,IN,False,None,Ernest,M,Zeng,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",B21A8A8B-69AF-46D0-9992-D388B89D6E38,2013-08-23
66,6447,IN,False,None,Ernest,M,Zhang,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",FB49508E-CAF9-44EC-8D0C-552F186A3EDE,2014-05-06
67,6470,IN,False,None,Ernest,C,Zhao,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",13243229-8DC3-46A2-A625-ADA15B0BBFBA,2011-11-08
68,6466,IN,False,None,Ernest,P,Zhou,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",675CDE8F-EDA6-42F9-8DBC-4CCA2FE9CAC8,2013-05-05
69,6478,IN,False,None,Ernest,None,Zhu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CBD5CF45-D183-4C06-9CFB-B90CB3663C4F,2012-03-14

### Desafio 1

Quantos produtos temos cadastrados no sistema que custam mais de 1500 dólares?

In [26]:
query = """
        SELECT COUNT(*)
        FROM Production.Product
        WHERE ListPrice > 1500;
        """
pd.read_sql(query, conn)

0  39

### Desafio 2

Quantas pessoas temos que com o sobrenome que inicia com a letra P?

In [27]:
query = """
        SELECT COUNT(*)
        FROM Person.Person
        WHERE FirstName LIKE 'P_%';
        """
pd.read_sql(query, conn)

0  347

### Desafio 3

Em quantas cidades únicas estão cadastrados nossos clientes?

In [28]:
query = """
        SELECT  COUNT( DISTINCT City )
        FROM Person.Address;
        """
pd.read_sql(query, conn)

0  575

### Desafio 4 
Quais são as cidades únicas que temos cadastradas em nosso sistema?

In [29]:
query = """
        SELECT  DISTINCT City
        FROM Person.Address;
        """
pd.read_sql(query, conn)

                City
0         Cheltenham
1          Kingsport
2           Suresnes
3          Baltimore
4            Reading
..               ...
570           Orange
571         Norridge
572  South Melbourne
573   Trabuco Canyon
574         Sarasota

[575 rows x 1 columns]

### Desafio 5
Quantos produtos vermelhos tem o preço entre 500 e 1000 dólares?

In [30]:
query = """
        SELECT  COUNT(*)
        FROM AdventureWorks2017.Production.Product
        WHERE Color = 'RED' AND ListPrice BETWEEN 500 AND 1000;
        """
pd.read_sql(query, conn)

0  11

### Desafio 6

Quantos produtos cadastrados tem a palavra 'road' no nome deles?

In [31]:
query = """
        SELECT COUNT(*)
        FROM Production.Product
        WHERE Name LIKE '%road%';
        """
pd.read_sql(query, conn)

0  103

## MIN,MAX,SUM E AVG

A MIN()função retorna o menor valor da coluna selecionada.

A MAX()função retorna o maior valor da coluna selecionada.

A SUM()função retorna a soma total de uma coluna numérica. 

A AVG()função retorna o valor médio de uma coluna numérica. 


Sintaxe


SELECT  FUN(column1) AS "NEW NAME"

FROM table_name

In [32]:
query = """
        SELECT TOP 10 SUM(LineTotal) AS "Soma"
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

           Soma
0  1.098464e+08

In [33]:
query = """
        SELECT TOP 10 MIN(LineTotal) AS "Min"
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

     Min
0  1.374

In [34]:
query = """
        SELECT TOP 10 MAX(LineTotal) AS "Max"
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

         Max
0  27893.619

In [35]:
query = """
        SELECT TOP 10 AVG(LineTotal) AS "Média"
        FROM Sales.SalesOrderDetail;
        """
pd.read_sql(query, conn)

        Média
0  905.449206

## GROUP BY

A cláusula SQL GROUP BY é usada em colaboração com a instrução SELECT para organizar dados idênticos em grupos. Esta cláusula GROUP BY segue a cláusula WHERE em uma instrução SELECT e precede a cláusula ORDER BY.

Sintaxe

A sintaxe básica de uma cláusula GROUP BY é mostrada no bloco de código a seguir. A cláusula GROUP BY deve seguir as condições da cláusula WHERE e deve preceder a cláusula ORDER BY, se uma for usada.

SELECT column1, column2

FROM table_name

WHERE conditions 

GROUP BY column1, column2

ORDER BY column1, column2

### Desafio 1
Quantas pessoas têm o mesmo MiddleName agrupadas por o MiddleName ?

In [36]:
query = """
        SELECT  MiddleName,  COUNT(MiddleName) AS "Contagem"
        FROM AdventureWorks2017.Person.Person
        GROUP BY MiddleName
        """
pd.read_sql(query, conn)

          MiddleName  Contagem
0                 R.        64
1                 F.        18
2                  O        64
3                  K       361
4                 H.         2
..               ...       ...
66                G.         1
67               Jan         1
68                 I        96
69                 V       132
70  Barreiro Gambaro         2

[71 rows x 2 columns]

### Desafio 2
Em média qual é a quantidade que cada produto é vendido na loja ?

In [37]:
query = """
        SELECT ProductID, AVG(OrderQty) AS "Média"
        FROM Sales.SalesOrderDetail
        GROUP BY ProductID;
        """
pd.read_sql(query, conn)

     ProductID  Média
0          925      2
1          902      1
2          710      2
3          879      1
4          733      2
..         ...    ...
261        741      1
262        790      2
263        990      1
264        933      1
265        984      2

[266 rows x 2 columns]

### Desafio 3
Quais foram as 10 vendas que no total tiveram os maiores valores de venda por produto do maior valor para o menor ?

In [38]:
query = """
        SELECT TOP 10 ProductID, SUM(LineTotal)
        FROM Sales.SalesOrderDetail
        GROUP BY ProductID
        ORDER BY SUM(LineTotal) DESC;
        """
pd.read_sql(query, conn)

   ProductID
0        782  4.400593e+06
1        783  4.009495e+06
2        779  3.693678e+06
3        780  3.438479e+06
4        781  3.434257e+06
5        784  3.309673e+06
6        793  2.516857e+06
7        794  2.347656e+06
8        795  2.012448e+06
9        753  1.847819e+06

### Desafio 4
Quantos produtos e qual a quantidade média de produtos temos
cadastrados nas nossas ordem de serviço, agrupados por ProductId ?

In [39]:
query = """
    SELECT ProductID, COUNT(ProductID) AS "Contagem", AVG(OrderQty) AS               "Média"
    FROM Production.WorkOrder
    GROUP BY ProductID;
        """
pd.read_sql(query, conn)

     ProductID  Contagem  Média
0          925        71     13
1          902        53      6
2          733        21     38
3          401      1092    117
4          756        12     28
..         ...       ...    ...
233        741        57     11
234        778        64      9
235        790       137      5
236        990        58      6
237        984        50      9

[238 rows x 3 columns]

## HAVING

A cláusula HAVING permite que você especifique as condições que filtram quais resultados de grupo aparecem nos resultados.

A cláusula WHERE coloca condições nas colunas selecionadas, enquanto a cláusula HAVING coloca condições nos grupos criados pela cláusula GROUP BY.

Sintaxe

O bloco de código a seguir mostra a posição da cláusula HAVING em uma consulta.
***
SELECT

FROM

WHERE

GROUP BY

***
A cláusula HAVING deve seguir a cláusula GROUP BY em uma consulta e também deve preceder a cláusula ORDER BY, se usada. O seguinte bloco de código tem a sintaxe da instrução SELECT, incluindo a cláusula HAVING -

HAVING

ORDER BY

SELECT column1, column2

FROM table1, table2

WHERE conditions

GROUP BY column1, column2

HAVING conditions

ORDER BY column1, column2
***

### Desafio 1

Estamos querendo identificar as províncias (stateProvinceId) com o maior
número de cadastros no nosso sistema, então é preciso encontrar quais
províncias(stateProvinceId) estão registradas no banco de dados mais
de 1000 vezes.

In [40]:
query = """
    SELECT stateProvinceId, COUNT(stateProvinceId) "quantidade"
    FROM Person.Address
    GROUP BY stateProvinceId
    HAVING COUNT(stateProvinceId)>1000;
        """
pd.read_sql(query, conn)

   stateProvinceId  quantidade
0                7        1579
1                9        4564
2               14        1954
3               50        1588
4               58        1105
5               79        2636

### Desafio 1
Sabendo que se trata de uma multinacional, os gerentes querem saber quais
produtos(productId) não estão trazendo em média no mínimo 1 milhão em total
de vendas(LineTotal)

In [41]:
query = """
    SELECT ProductID, AVG(LineTotal)
    FROM Sales.SalesOrderDetail
    GROUP BY ProductID
    HAVING AVG(LineTotal) < 1000000
        """
pd.read_sql(query, conn)

     ProductID
0          925   412.266180
1          902   360.093600
2          710    11.659090
3          879   159.000000
4          733   730.018636
..         ...          ...
261        741  1506.756382
262        790  3577.611399
263        990   698.940902
264        933    32.600000
265        984   656.513266

[266 rows x 2 columns]

## AS

O comando AS  é usado para renomear uma coluna ou tabela.

SELECT CustomerID AS ID, CustomerName AS Customer
FROM Customers;

### Desafio 1

Encontrar o FirstName e LastName da tabela Person.Person e retornar com as colunas em português.

In [42]:
query = """
    SELECT FirstName AS 'Primeiro Nome', LastName AS 'Ultimo Nome'
    FROM Person.Person
        """
pd.read_sql(query, conn)

      Primeiro Nome  Ultimo Nome
0              Syed        Abbas
1         Catherine         Abel
2               Kim  Abercrombie
3               Kim  Abercrombie
4               Kim  Abercrombie
...             ...          ...
19967      Patricia       Zubaty
19968          Judy     Zugelder
19969          Jake     Zukowski
19970       Michael     Zwilling
19971       Michael     Zwilling

[19972 rows x 2 columns]

### Desafio 2 

Encontrar o coluna ProductNumber da tabela Production.product e renomear para "Numero do produto".

In [43]:
query = """
    SELECT ProductNumber as "Numero do Produto"
    FROM Production.Product
        """
pd.read_sql(query, conn)

    Numero do Produto
0             AR-5381
1             BA-8327
2             BB-7421
3             BB-8107
4             BB-9108
..                ...
499           TT-T092
500         VE-C304-L
501         VE-C304-M
502         VE-C304-S
503           WB-H098

[504 rows x 1 columns]

### Desafio 3

Encontrar o coluna UnitPrice da tabela Sales.SalesOrderDetail e renomear para "Preço Unitário".

In [44]:
query = """
    SELECT UnitPrice as "Preço Unitário"
    FROM Sales.SalesOrderDetail
        """
pd.read_sql(query, conn)

        Preço Unitário
0             2024.994
1             2024.994
2             2024.994
3             2039.994
4             2039.994
...                ...
121312          21.980
121313           8.990
121314          21.980
121315         159.000
121316           8.990

[121317 rows x 1 columns]